
&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	Для Каждого Строка Из СписокНоменклатуры Цикл
		СерияОбъект = Строка.СерияНоменклатуры.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СерияОбъект, Строка, "УчетныйНомер, ЗаводскойНомер");
		СерияОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ДокументПоступления = Параметры.ДокументПоступления;
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	               |	ПоступлениеТоваровТовары.СерияНоменклатуры.УчетныйНомер КАК УчетныйНомер,
	               |	ПоступлениеТоваровТовары.СерияНоменклатуры.ЗаводскойНомер КАК ЗаводскойНомер
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |ГДЕ
	               |	НЕ ПоступлениеТоваровТовары.СерияНоменклатуры = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	               |	И ПоступлениеТоваровТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.ДокументПоступления);
	
	СписокНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
