#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// Инициализация и заполнение документа
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеПоддержкаПроектов.СформироватьДвиженияПоРегистрам(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеПоддержкаПроектов.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Не Отказ Тогда
		СтруктураПоиска = Новый Структура("ВидДвижения, СуммаВВалютеПроекта", ПредопределенноеЗначение("Перечисление.ВидДвижения.Расход"), 0);
		СтрокиРасхода = Перечисления.НайтиСтроки(СтруктураПоиска);

		Для Каждого Строка Из СтрокиРасхода Цикл			
			СтруктураКурсаПроекта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Строка.Дата);
			КоэффициентПересчетаВВалютуПроекта = СтруктураКурсаПроекта.Курс / СтруктураКурсаПроекта.Кратность;
			Строка.СуммаВВалютеПроекта = Строка.Сумма / КоэффициентПересчетаВВалютуПроекта;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти //Обработчики событий


#Область СлужебныеПроцедурыИФункции
Процедура ИнициализироватьДокумент()
	
	Автор = Пользователи.ТекущийПользователь();
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ЗначениеНастроекПоддержкаПроектовПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	КонецЕсли;
	
	ЗаполнитьПоляПоУмолчанию();
	
КонецПроцедуры

Процедура ЗаполнитьПоляПоУмолчанию()
	
	Организация = ЗначениеНастроекПоддержкаПроектовПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

//Процедура ЗаполнитьПоЗначениямАвтозаполнения()
//	
//	ОбщегоНазначенияПоддержкаПроектов.ЗаполнитьПоЗначениямАвтозаполнения(ЭтотОбъект, Неопределено, "Организация");
//	
//КонецПроцедуры
//
//Процедура ЗаполнитьДокументПоОтбору(ДанныеЗаполнения)
//	
//	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
//	
//КонецПроцедуры

Функция СписокРегистровДляКонтроля() Экспорт
	
	РегистрыДляКонтроля = Новый Массив;
		
	Возврат РегистрыДляКонтроля;
	
КонецФункции
#КонецОбласти

#КонецЕсли