
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Возвращает параметры учета номенклатуры на складе
//
Функция ПараметрыУчетаНоменклатуры(Склад) Экспорт
	
	ПараметрыФО = Новый Структура("Склад", Склад);
	
	ПараметрыУчета = Новый Структура;
	ПараметрыУчета.Вставить("ИспользоватьСерииНоменклатуры", ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", ПараметрыФО));
	ПараметрыУчета.Вставить("ИспользоватьПартии", ПолучитьФункциональнуюОпцию("ИспользоватьПартииСклад", ПараметрыФО));
	
	Возврат ПараметрыУчета;
	
КонецФункции

// Возвращает имя реквизита склада, с которого выбывает товар.
//
// Параметры:
//  Объект - ДокументОбъект
//
// Возвращаемое значение:
//  Строка - имя реквизита склада отправителя, если он есть в объекте, иначе Неопределено.
//
Функция ИмяРеквизитаСкладОтправитель(Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
		Возврат "СкладОтправитель";
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
		Возврат "Склад";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
