
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ПОДСИСТЕМЫ
#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПроекту(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	//ПараметрыОтчета = Новый Структура();
	//ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("Закупки", ПараметрыОтчета);
	

	ПользовательскиеНастройки = ПолучитьНастройкиПоУмолчанию("Закупки");
    Отбор = Новый Структура("ПроектЗадания", Элементы.Список.ТекущаяСтрока);
	//Для Каждого ЭлПараметр Из Отбор Цикл
	//    Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
	//        Если ТипЗнч(ПараметрСКД) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда  
	//            Если Строка(ПараметрСКД.ЛевоеЗначение) = ЭлПараметр.Ключ Тогда 
	//                ПараметрСКД.Значение = ЭлПараметр.Значение;
	//                ПараметрСКД.Использование = Истина;
	//            КонецЕсли;
	//        КонецЕсли;
	//    КонецЦикла;    
	//КонецЦикла;
	ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии, КлючВарианта, Отбор, ПользовательскиеНастройки", Истина, "Основной", Отбор, ПользовательскиеНастройки);
	ОткрытьФорму("Отчет.Закупки.Форма", ПараметрыОтчета);
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиПоУмолчанию(ТипОтчета)
	СхемаКомпоновкиДанных = Отчеты[ТипОтчета].ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

    КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных();
    КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Возврат КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки;
КонецФункции

&НаСервере
Функция УстановитьПользовательскиеНастройкиОтчета(ТипОтчета, СтруктураПараметров)
    СтруктураНастроек = Новый Структура;
    ОтчетОбъект = Отчеты[ТипОтчета].Создать();
    
    ПользовательскиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
    Для Каждого ЭлПараметр  Из СтруктураПараметров Цикл
        Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
            Если ТипЗнч(ПараметрСКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда  
                Если строка(ПараметрСКД.Параметр) = ЭлПараметр.Ключ Тогда 
                    ПараметрСКД.Значение = ЭлПараметр.Значение;
                    ПараметрСКД.Использование = Истина;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;    
    КонецЦикла;
        
    Возврат ПользовательскиеНастройки;
КонецФункции
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти // СтандартныеПодсистемы