
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции установки статусов для массива документов.

// Устанавливает статус для списка документов
//
// Параметры:
//  МассивДокументов        - Массив - Массив документов
//  НовыйСтатус             - Строка - Имя нового статуса для документов
//  ДополнительныеПараметры - Структура - Структура дополнительных параметров
//
// Возвращаемое значение:
//  Число - Количество документов у которых был изменен статус
//
// ВАЖНО. При использования процедуры для каждого типа документа из массива должны быть объявлены функции:
// В модуле менеджера документа:
//  Функция СформироватьЗапросПроверкиПриСменеСтатуса(МассивДокументов, НовыйСтатус, ДополнительныеПараметры) Экспорт
//  Функция ПроверкаПередСменойСтатуса(ВыборкаПроверки, НовыйСтатус, ДополнительныеПараметры) Экспорт
// В модуле объекта документа:
//  Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
//
Функция УстановитьСтатусОбъектов(Знач Объекты, Знач НовыйСтатус, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияПоддержкаПроектов.УстановитьСтатусОбъектов(Объекты, НовыйСтатус, ДополнительныеПараметры);
	
КонецФункции

// Возвращает значение пометки удаления объекта
//
// Параметры:
//  Ссылка
//
// Возвращаемое значение:
//  Булево - истина, если объект помечен на удаление
//
Функция ОбъектПомеченНаУдаление(Знач Ссылка) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
	
КонецФункции

// Изменяет пометку удаления объекта
//
// Параметры:
//  Ссылка - объект, для которого изменяется пометка удаления
//
Процедура УстановитьПометкуУдаления(Знач Ссылка) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(Не Объект.ПометкаУдаления, Истина);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

// См. эту процедуру в модуле ОбщегоНазначенияПоддержкаПроектовСобытия.
// Предназначена для поддержки толстого клиента (вариант клиент-сервер).
//
Процедура ПереопределитьПолучаемуюФормуВалют(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияПоддержкаПроектовСобытия.ПереопределитьПолучаемуюФормуВалют(
		Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции