#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииЗависимостиКонстант(ТаблицаКонстант) Экспорт
	
	ИмяКонстанты = Метаданные().Имя;
	
	ОбщегоНазначенияПоддержкаПроектов.ДобавитьЗависимостьКонстант(ТаблицаКонстант,
		ИмяКонстанты                                            , Ложь,
		Метаданные.Константы.ИспользоватьЗаказыНаПеремещение.Имя, Ложь);
	
	ОбщегоНазначенияПоддержкаПроектов.ДобавитьЗависимостьКонстант(ТаблицаКонстант,
		ИмяКонстанты                                                  , Ложь,
		Метаданные.Константы.ИспользоватьСтатусыПеремещенийТоваров.Имя, Ложь);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли