
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоНовый() Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ОбновитьПрисоединенныеФайлы();
	
КонецПроцедуры

Процедура ОбновитьПрисоединенныеФайлы ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаПредприятияПрисоединенныеФайлы.Ссылка КАК Файл
	|ИЗ
	|	Справочник.ЗаявкаПредприятияПрисоединенныеФайлы КАК ЗаявкаПредприятияПрисоединенныеФайлы
	|ГДЕ
	|	ЗаявкаПредприятияПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И ЗаявкаПредприятияПрисоединенныеФайлы.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	Запрос.УстановитьПараметр("ПометкаУдаления", НЕ ПометкаУдаления);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
			ФайлОъект = РезультатЗапроса.Файл.ПолучитьОбъект();
			ФайлОъект.ПометкаУдаления = ПометкаУдаления;
			ФайлОъект.ОбменДанными.Загрузка = Истина;
			ФайлОъект.Записать();
	КонецЦикла; 
	
КонецПроцедуры

	

