#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииЗависимостиКонстант(ТаблицаКонстант) Экспорт
	
	ОбщегоНазначенияПоддержкаПроектов.ДобавитьЗависимостьКонстант(ТаблицаКонстант,
		Метаданные.Константы.ИспользоватьПолнотекстовыйПоиск.Имя, Ложь,
		Метаданные().Имя                                        , Ложь);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли