#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ВидНоменклатуры");
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		ВидНоменклатуры = Владелец;
	КонецЕсли;
	
	ПараметрыСерий = ЗначениеНастроекПоддержкаПроектовПовтИсп.ПараметрыСерийНоменклатуры(ВидНоменклатуры);
	 
	НепроверяемыеРеквизиты.Добавить("УчетныйНомер");
	НепроверяемыеРеквизиты.Добавить("ЗаводскойНомер");
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ВидНоменклатуры");
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		ВидНоменклатуры = Владелец;
	КонецЕсли;
	
	ПараметрыСерий = ЗначениеНастроекПоддержкаПроектовПовтИсп.ПараметрыСерийНоменклатуры(ВидНоменклатуры);
	
	УчетныйНомер = СокрЛП(УчетныйНомер);
	ЗаводскойНомер = СокрЛП(ЗаводскойНомер);
	
	Наименование = Справочники.СерииНоменклатуры.ПредставлениеСерии(ПараметрыСерий, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#КонецЕсли