#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Добавляет команду отчета в список команд
// 
// Параметры:
//  КомандыОтчетов - ТаблицаЗначений - Таблица команд для вывода в подменю. Для изменения.
// 
// Возвращаемое значение:
//  Неопределено, СтрокаТаблицыЗначений - Добавить команду отчета
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	МетаданныеОтчета = Метаданные.Отчеты.СпецификацияЗаданий;
	
	Если ПравоДоступа("Просмотр", МетаданныеОтчета) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		КомандаОтчет.Идентификатор      = МетаданныеОтчета.ПолноеИмя();
		КомандаОтчет.Менеджер           = КомандаОтчет.Идентификатор;
		КомандаОтчет.Представление      = НСтр("ru = 'История изменений спецификации задания'");
		КомандаОтчет.Важность           = МенюОтчетыПоддержкаПроектов.ПодменюОтчетыВажное();
		КомандаОтчет.ИмяПараметраФормы  = "ПараметрКоманды"; 
	
		
		Возврат КомандаОтчет;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли