
Процедура ОбновитьКлючиАналитикиПриЗаписи(Источник, Отказ) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	               |ГДЕ
	               |	(КлючиАналитикиУчетаНоменклатуры.Партия = &Источник
	               |			ИЛИ КлючиАналитикиУчетаНоменклатуры.СерияНоменклатуры = &Источник)";
	Запрос.УстановитьПараметр("Источник", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КлючАналитики = Выборка.Ссылка.ПолучитьОбъект();
		Справочники.КлючиАналитикиУчетаНоменклатуры.ЗаполнитьНаименованиеКлючаАналитики(КлючАналитики, КлючАналитики);
		КлючАналитики.Записать();
	КонецЕсли;
КонецПроцедуры

Функция ВыводитьОписаниеНоменклатуры() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ВыводитьОписаниеНоменклатурыНаПечать");
Конецфункции