#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Функция возвращает элемент таблицы доступных печатных форм объекта печати
// 
// Параметры:
//  ПечатныеФормы - ТаблицаЗначений
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - Добавить печатную форму
Функция ДобавитьПечатнуюФорму(ПечатныеФормы) Экспорт
	
	МетаданныеМакета = МетаданныеМакета();
	МенеджерПечати = МетаданныеМакета.Родитель().ПолноеИмя();
	
	ПечатнаяФорма = УправлениеПечатьюПоддержкаПроектов.ДобавитьПечатнуюФорму(ПечатныеФормы, "ИнвентаризационнаяОписьНФА_0504087", МенеджерПечати);
	ПечатнаяФорма.ПутьКМакету = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакета);
	ПечатнаяФорма.Представление = МетаданныеМакета.Представление();
	
	ПечатнаяФорма.Параметризуемая = Истина;
	ПечатнаяФорма.ДополнительныеПараметры.Вставить("БезФактическихДанных", Ложь);
	
	Возврат ПечатнаяФорма;
	
КонецФункции

// Функция возвращает элемент таблицы доступных печатных форм объекта печати
// 
// Параметры:
//  ПечатныеФормы - ТаблицаЗначений
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - Добавить печатную форму
Функция ДобавитьПечатнуюФормуАктИнвентаризации(ПечатныеФормы) Экспорт
	
	МетаданныеМакета = МетаданныеМакетаАктИнвентаризации();
	МенеджерПечати = МетаданныеМакета.Родитель().ПолноеИмя();
	
	ПечатнаяФорма = УправлениеПечатьюПоддержкаПроектов.ДобавитьПечатнуюФорму(ПечатныеФормы, "АктИнвентаризации", МенеджерПечати);
	ПечатнаяФорма.ПутьКМакету = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакета);
	ПечатнаяФорма.Представление = МетаданныеМакета.Представление();
	
	ПечатнаяФорма.Параметризуемая = Истина;
	ПечатнаяФорма.ДополнительныеПараметры.Вставить("БезФактическихДанных", Ложь);
		
	Возврат ПечатнаяФорма;
	
КонецФункции

// Функция формирует печатную форму требование накладная ф.0504204
// 
// Параметры:
//  МассивОбъектов - Неопределено
//  ОбъектыПечати - Неопределено
//  ПараметрыПечати - Неопределено
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Печать инвентаризационная опись НФА 0504087
Функция ПечатьИнвентаризационнаяОписьНФА_0504087(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	
	ПолноеИмяМакета = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакета());
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПолноеИмяМакета;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолноеИмяМакета);
	
	СтруктураТипов = ОбщегоНазначенияПоддержкаПроектов.РазложитьМассивСсылокПоТипам(МассивОбъектов);
	
	НомерТипаДокумента = 0;
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечати(СтруктураОбъектов.Значение, ПараметрыПечати);
		
		СформироватьТабличныйДокумент(ТабличныйДокумент, Макет, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Печать акт инвентаризации.
// 
// Параметры:
//  МассивОбъектов - ДокументСсылка.ИнвентаризацияТоваровНаСкладе
//  ОбъектыПечати - Неопределено
//  ПараметрыПечати - Структура
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Печать акт инвентаризации
Функция ПечатьАктИнвентаризации(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	
	ПолноеИмяМакета = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакетаАктИнвентаризации());
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПолноеИмяМакета;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолноеИмяМакета);
	
	СтруктураТипов = ОбщегоНазначенияПоддержкаПроектов.РазложитьМассивСсылокПоТипам(МассивОбъектов);
	
	НомерТипаДокумента = 0;
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечати(СтруктураОбъектов.Значение, ПараметрыПечати);
		
		СформироватьТабличныйДокументАктИнвентаризации(ТабличныйДокумент, Макет, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Сформировать табличный документ акт инвентаризации.
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - Табличный документ
//  Макет - ТабличныйДокумент, Произвольный, ГрафическаяСхема, ОболочкаHTMLДокумента, ГеографическаяСхема, ДвоичныеДанные, МакетОформленияКомпоновкиДанных, ОболочкаActiveDocument, ТекстовыйДокумент, СхемаКомпоновкиДанных - Макет
//  ДанныеДляПечати - Структура - Данные для печати:
// * ОсновныеДанные - ВыборкаИзРезультатаЗапроса - 
//  ОбъектыПечати - Неопределено - Объекты печати
Процедура СформироватьТабличныйДокументАктИнвентаризации(ТабличныйДокумент, Макет, ДанныеДляПечати, ОбъектыПечати) Экспорт
		
	Шапка = ДанныеДляПечати.ОсновныеДанные;
		
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
				
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеШапки = ПолучитьДанныеШапкиДокументаАктИнвентаризации(Шапка);
				
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Шапка", ДанныеШапки);
		
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ШапкаТаблицы", ДанныеШапки);
		
		// Вывод многострочной части
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		КлючиПараметров = ФормированиеПечатныхФормПоддержкаПроектов.ПолучитьИменаКолонокТаблицы(ВыборкаСтрокТовары);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

		НомерСтроки = 0;

		Пока ВыборкаСтрокТовары.Следующий() Цикл

			НомерСтроки = НомерСтроки + 1;

			ДанныеСтроки = Новый Структура(КлючиПараметров);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВыборкаСтрокТовары);

			ТоварНаименование = ОбщегоНазначенияПоддержкаПроектов.ПолучитьПредставлениеНоменклатурыДляПечати(
				ВыборкаСтрокТовары.ТоварНаименование, ВыборкаСтрокТовары.Серия);

			ДанныеСтроки.Вставить("НомерПП", НомерСтроки);
			ДанныеСтроки.Вставить("РегНомер_МСИ", ТоварНаименование);
			ДанныеСтроки.Вставить("КоличествоФакт", ВыборкаСтрокТовары.ФактКоличество);
			ДанныеСтроки.Вставить("КоличествоУчет", ВыборкаСтрокТовары.БухКоличество);
			ДанныеСтроки.Вставить("Производитель", ВыборкаСтрокТовары.Производитель);
			//@skip-check wrong-string-literal-content
			ДанныеСтроки.Вставить("ИндексГЗ", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСтрокТовары.ПроектЗадания, "Номер")));

			//@skip-check wrong-string-literal-content
			ДанныеСтроки.Вставить("ДО_ГодПоступления", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1, %2",
				ВыборкаСтрокТовары.КонтрагентНаименование, Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ВыборкаСтрокТовары.ДокументОприходования, "Дата"), "ДФ='yyyy ""г.""';")));
			
			ОбластьСтрока.Параметры.Заполнить(ДанныеСтроки);

			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока);

			СтрокаПомещаетсяНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент,
				МассивВыводимыхОбластей);

			Если Не СтрокаПомещаетсяНаСтраницу Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ШапкаТаблицы", ДанныеШапки);
			КонецЕсли;
			
			// Вывод области Строка
			ТабличныйДокумент.Вывести(ОбластьСтрока);
					
		КонецЦикла;
		
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ПодвалТаблицы", ДанныеШапки);
		
		Для Каждого СтрокаКомиссии Из ДанныеШапки.ТаблицаКомиссии Цикл
				ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "СтрокаКомиссия", СтрокаКомиссии);	
		КонецЦикла;
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТабличныйДокумент(ТабличныйДокумент, Макет, ДанныеДляПечати, ОбъектыПечати)
	
	МассивВыводимыхОбластей = Новый Массив;
	
	ВалютаПечати = ЗначениеНастроекПоддержкаПроектовПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Шапка = ДанныеДляПечати.ОсновныеДанные;
	
	ТекстИтогоПоСтранице = НСтр("ru = 'Итого по странице'") + ":";
	ТекстИтогоПоОписи    = НСтр("ru = 'Итого по описи'") + ":";
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(Шапка.Ссылка, ТабличныйДокумент, Макет);
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Получение параметров для заполнения
		ДанныеШапки = ПолучитьДанныеШапкиДокумента(Шапка);
		ТаблицаЦен  = ПолучитьТаблицуЦен(Шапка);
		
		// Вывод области Заголовок
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Заголовок", ДанныеШапки);
		
		// Вывод области Комиссии
		ОбластиКомиссии = СформироватьОбластиКомиссии(Макет, Шапка);
		
		Для Каждого ОбластьКомиссии Из ОбластиКомиссии Цикл
			ТабличныйДокумент.Вывести(ОбластьКомиссии);
		КонецЦикла;
		
		// Вывод области ДатаПодписи
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ДатаПодписи");
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Инициализация нумерации
		Нумерация = ИнициализироватьНумерацию();
		
		// Вывод области ШапкаТаблицы
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ШапкаТаблицы", Нумерация);
		
		// Инициализация итогов по документу
		ПараметрыИтогоПоСтранице = ИнициализироватьСтруктуруИтогов();
		ПараметрыИтогоПоОписи    = ИнициализироватьСтруктуруИтогов();
		
		// Вывод многострочной части
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		КлючиПараметров = ФормированиеПечатныхФормПоддержкаПроектов.ПолучитьИменаКолонокТаблицы(ВыборкаСтрокТовары);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			ФормированиеПечатныхФормПоддержкаПроектов.УвеличитьНомер(Нумерация, "НомерСтроки");
			
			ДанныеСтроки = Новый Структура(КлючиПараметров);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВыборкаСтрокТовары);
			
			ТоварНаименование = ОбщегоНазначенияПоддержкаПроектов.ПолучитьПредставлениеНоменклатурыДляПечати(
				ВыборкаСтрокТовары.ТоварНаименование,
				ВыборкаСтрокТовары.Серия,
				ВыборкаСтрокТовары.Партия,
				ВыборкаСтрокТовары.Описание);
			
			Цена = 0;
			Если ТаблицаЦен <> Неопределено Тогда
				СтрокаЦены = ТаблицаЦен.Найти(ВыборкаСтрокТовары.НомерСтроки, "НомерСтроки");
				Если СтрокаЦены <> Неопределено Тогда
					Цена = СтрокаЦены.Цена;
				КонецЕсли;
			КонецЕсли;
			
			ФактСумма = Окр(Цена * ВыборкаСтрокТовары.ФактКоличество, 2);
			БухСумма = Окр(Цена * ВыборкаСтрокТовары.БухКоличество, 2);
			
			НедостачаКоличество = ВыборкаСтрокТовары.БухКоличество - ВыборкаСтрокТовары.ФактКоличество;
			НедостачаСумма      = БухСумма - ФактСумма;
			
			// Если по факту оказалось меньше
			РезультатНедостачаКолво = ?(НедостачаКоличество > 0, НедостачаКоличество, 0);
			РезультатНедостачаСумма = ?(НедостачаКоличество > 0, ?(НедостачаСумма >= 0, НедостачаСумма, - НедостачаСумма), 0);
			// Если по факту оказалось больше
			РезультатИзлишекКолво   = ?(НедостачаКоличество < 0, - НедостачаКоличество, 0);
			РезультатИзлишекСумма   = ?(НедостачаКоличество < 0, - НедостачаСумма, 0);
			
			ДанныеСтроки.Вставить("НомерСтроки"            , Нумерация.НомерСтроки);
			ДанныеСтроки.Вставить("ТоварНаименование"      , ТоварНаименование);
			ДанныеСтроки.Вставить("Цена"                   , Окр(Цена, 2));
			ДанныеСтроки.Вставить("ФактКоличество"         , ВыборкаСтрокТовары.ФактКоличество);
			ДанныеСтроки.Вставить("ФактСумма"              , ФактСумма);
			ДанныеСтроки.Вставить("БухКоличество"          , ВыборкаСтрокТовары.БухКоличество);
			ДанныеСтроки.Вставить("БухСумма"               , БухСумма);
			ДанныеСтроки.Вставить("РезультатНедостачаКолво", РезультатНедостачаКолво);
			ДанныеСтроки.Вставить("РезультатНедостачаСумма", РезультатНедостачаСумма);
			ДанныеСтроки.Вставить("РезультатИзлишекКолво"  , РезультатИзлишекКолво);
			ДанныеСтроки.Вставить("РезультатИзлишекСумма"  , РезультатИзлишекСумма);
			
			ОбластьСтрока.Параметры.Заполнить(ДанныеСтроки);
			
			ЭтоПоследняяСтрока = Нумерация.НомерСтроки = КоличествоСтрок;
			СтрокаНеПомещаетсяНаСтраницу = ПроверитьВыводСтроки(ТабличныйДокумент, Макет, МассивВыводимыхОбластей, ОбластьСтрока, ЭтоПоследняяСтрока);
			
			Если СтрокаНеПомещаетсяНаСтраницу Тогда
				
				// Вывод области Итого по странице
				ПараметрыИтогоПоСтранице.Вставить("ТекстИтого", ТекстИтогоПоСтранице);
				ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Итого", ПараметрыИтогоПоСтранице);
				
				// Вывод области ИтогоПрописью по странице
				ПараметрыИтогоПрописью = СформироватьИтогиПрописью(ПараметрыИтогоПоСтранице, ВалютаПечати, Нумерация.НомерСтрокиНаСтранице, ТекстИтогоПоСтранице);
				ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ИтогоПрописью", ПараметрыИтогоПрописью);
				
				// Обнулить итоги по странице
				ФормированиеПечатныхФормПоддержкаПроектов.ОбнулитьИтоги(ПараметрыИтогоПоСтранице);
				ФормированиеПечатныхФормПоддержкаПроектов.УстановитьНачальныйНомер(Нумерация, "НомерСтрокиНаСтранице");
				
				// Перейти на следующую страницу
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				// Вывод области ШапкаТаблицы
				ФормированиеПечатныхФормПоддержкаПроектов.УвеличитьНомер(Нумерация, "НомерСтраницы");
				ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ШапкаТаблицы", Нумерация);
				
			КонецЕсли;
			
			// Вывод области Строка
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ФормированиеПечатныхФормПоддержкаПроектов.РассчитатьИтоги(ДанныеСтроки, ПараметрыИтогоПоСтранице);
			ФормированиеПечатныхФормПоддержкаПроектов.РассчитатьИтоги(ДанныеСтроки, ПараметрыИтогоПоОписи);
			
			ФормированиеПечатныхФормПоддержкаПроектов.УвеличитьНомер(Нумерация, "НомерСтрокиНаСтранице");
			
		КонецЦикла;
		
		// Вывод области Итого по странице
		ПараметрыИтогоПоСтранице.Вставить("ТекстИтого", ТекстИтогоПоСтранице);
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Итого", ПараметрыИтогоПоСтранице);
		
		// Вывод области Итого по описи
		ПараметрыИтогоПоОписи.Вставить("ТекстИтого", ТекстИтогоПоОписи);
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Итого", ПараметрыИтогоПоОписи);
		
		// Вывести итоги прописью по странице
		ПараметрыИтогоПрописью = СформироватьИтогиПрописью(ПараметрыИтогоПоСтранице, ВалютаПечати, Нумерация.НомерСтрокиНаСтранице, ТекстИтогоПоСтранице);
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ИтогоПрописью", ПараметрыИтогоПрописью);
		
		// Вывод области ИтогоПрописью на следующей странице
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ПараметрыИтогоПрописью = СформироватьИтогиПрописью(ПараметрыИтогоПоОписи, ВалютаПечати, Нумерация.НомерСтроки, ТекстИтогоПоОписи);
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "ИтогоПрописью", ПараметрыИтогоПрописью);
		
		// Вывод области КомментарииПодписи
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "КомментарииПодписи");
		
		// Вывод области Комиссии
		Для Каждого ОбластьКомиссии Из ОбластиКомиссии Цикл
			ТабличныйДокумент.Вывести(ОбластьКомиссии);
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеШапкиДокумента(Шапка)
	
	КлючиПараметров = ФормированиеПечатныхФормПоддержкаПроектов.ПолучитьИменаКолонокТаблицы(Шапка);
	
	Параметры = Новый Структура(КлючиПараметров);
	ЗаполнитьЗначенияСвойств(Параметры, Шапка);
	
	СведенияОбОрганизации    = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ОрганизацияПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
	
	МОЛ = РегистрыСведений.МатериальноОтветственныеЛица.ПолучитьДанныеОтветственного(Шапка.Склад, Шапка.ДатаДокумента);
	
	Параметры.Вставить("НомерДокумента"             , ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.НомерДокумента));
	Параметры.Вставить("ДатаДокументаИнвентаризации", НСтр("ru = 'на'") + " " + Формат(Шапка.ДатаДокумента, "ДЛФ=DD"));
	Параметры.Вставить("ОрганизацияПредставление"   , ОрганизацияПредставление);
	Параметры.Вставить("ОрганизацияОКПО"            , СведенияОбОрганизации.КодПоОКПО);
	Параметры.Вставить("МОЛОтветственный"           , МОЛ.Ответственный);
	Параметры.Вставить("МОЛФИО"                     , МОЛ.ФИО);
	Параметры.Вставить("МОЛДолжность"               , МОЛ.Должность);
	Параметры.Вставить("НачальныйНомерПоПорядку"    , 1);
	Параметры.Вставить("НомерКонца"                 , Шапка.Товары.Выбрать().Количество());
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьДанныеШапкиДокументаАктИнвентаризации(Шапка)

	КлючиПараметров = ФормированиеПечатныхФормПоддержкаПроектов.ПолучитьИменаКолонокТаблицы(Шапка);

	Параметры = Новый Структура(КлючиПараметров);
	ЗаполнитьЗначенияСвойств(Параметры, Шапка);

	СведенияОбОрганизации    = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	
	ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Шапка.Организация,
		Шапка.ДатаДокумента);

	МОЛ = РегистрыСведений.МатериальноОтветственныеЛица.ПолучитьДанныеОтветственного(Шапка.Склад, Шапка.ДатаДокумента);

	Параметры.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.НомерДокумента));
	Параметры.Вставить("ДатаДокумента", Формат(Шапка.ДатаДокумента, "ДЛФ=DD"));
	Параметры.Вставить("ПредставлениеОрганизации", СведенияОбОрганизации.ОфициальноеНаименование);
	Параметры.Вставить("ОрганизацияОКПО", СведенияОбОрганизации.КодПоОКПО);
	Параметры.Вставить("МОЛОтветственный", МОЛ.Ответственный);
	Параметры.Вставить("МОЛФИО", МОЛ.ФИО);
	Параметры.Вставить("МОЛДолжность", МОЛ.Должность);
	Параметры.Вставить("НачальныйНомерПоПорядку", 1);
	Параметры.Вставить("НомерКонца", Шапка.Товары.Выбрать().Количество());
	Параметры.Вставить("РуководительФИО", ОтветственныеЛица.РуководительНаименование);
	Параметры.Вставить("РуководительДолжность", ОтветственныеЛица.РуководительДолжность);
	Параметры.Вставить("Гриф", Шапка.Гриф);
	Параметры.Вставить("МестоХранения", Шапка.ПредставлениеСклада);

	СклонениеТипаРаспоряжения = ПолучитьСклоненияСтроки(Шапка.ДокументОснованиеВид, , "ПД=Родительный");

	Если СклонениеТипаРаспоряжения.Количество() Тогда
		Параметры.Вставить("ТипРаспоряжения", СклонениеТипаРаспоряжения[0]);
	КонецЕсли;

	Параметры.Вставить("ДатаРаспоряжения", Формат(Шапка.ДокументОснованиеДата, "ДФ='dd.MM.yyyy ""г.""';"));
	Параметры.Вставить("НомерРаспоряжения", Шапка.ДокументОснованиеНомер);
	
	ВыборкаСоставКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();
	
	СоставКомиссии = "";

	ТаблицаКомиссии = Новый ТаблицаЗначений;
	ТаблицаКомиссии.Колонки.Добавить("Должность");
	ТаблицаКомиссии.Колонки.Добавить("ФИО");

	Пока ВыборкаСоставКомиссии.Следующий() Цикл

		СоставКомиссии = СоставКомиссии + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2, ",
			ВыборкаСоставКомиссии.Должность, ФизическиеЛицаКлиентСервер.ФамилияИнициалы(
				ВыборкаСоставКомиссии.ЧленКомиссии));
				
		СтрокаКомиссии = ТаблицаКомиссии.Добавить();
		
		СтрокаКомиссии.Должность = ВыборкаСоставКомиссии.Должность;
		СтрокаКомиссии.ФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСоставКомиссии.ЧленКомиссии);

	КонецЦикла;

	СоставКомиссии = Лев(СоставКомиссии, СтрДлина(СоставКомиссии) - 2);

	Параметры.Вставить("СоставКомиссии", СоставКомиссии);

	Параметры.Вставить("ТаблицаКомиссии", ТаблицаКомиссии);

	Возврат Параметры;

КонецФункции

Функция ПолучитьТаблицуЦен(Шапка)
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Шапка.Ссылка);
	Возврат МенеджерОбъекта.ПолучитьТаблицуЦен(Шапка);
	
КонецФункции

Функция СформироватьОбластиКомиссии(Макет, Шапка)
	
	ОбластиКомиссии = Новый Массив;
	
	ПустыеСтроки = 4;
	ПредседательВСоставе = Истина;
	
	Комиссия = Шапка.ИнвентаризационнаяКомиссия.Выбрать();
	КоличествоЧленовКомиссии = Комиссия.Количество();
	
	Для НомерЧленаКомиссии = 1 По Макс(КоличествоЧленовКомиссии, ПустыеСтроки) Цикл
		
		Параметры = Новый Структура;
		
		Если НомерЧленаКомиссии > КоличествоЧленовКомиссии Тогда
			ЧленКомиссииСтатус = ?(НомерЧленаКомиссии = 1, НСтр("ru = 'Председатель комиссии'"), ?(НомерЧленаКомиссии = 2, НСтр("ru = 'Члены комиссии'"), ""));
			Параметры.Вставить("Статус", ЧленКомиссииСтатус);
		Иначе
			
			Комиссия.Следующий();
			
			Если Комиссия.Председатель И НомерЧленаКомиссии = 1 Тогда
				Параметры.Вставить("Статус", НСтр("ru = 'Председатель комиссии'"));
				ПредседательВСоставе = Истина;
			ИначеЕсли ПредседательВСоставе И НомерЧленаКомиссии = 2
				  Или НомерЧленаКомиссии = 1 Тогда
				Параметры.Вставить("Статус", НСтр("ru = 'Члены комиссии'"));
			КонецЕсли;
			
			Параметры.Вставить("ПодписьФИО"      , ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Комиссия.Представление)));
			Параметры.Вставить("ПодписьДолжность", Комиссия.Должность);
			
		КонецЕсли;
		
		ФормированиеПечатныхФормПоддержкаПроектов.ДобавитьОбластьВМассивПоОписанию(Макет, "Подписи", ОбластиКомиссии, Параметры);
		
	КонецЦикла;
	
	Возврат ОбластиКомиссии;
	
КонецФункции

Функция ИнициализироватьСтруктуруИтогов()
	
	ПараметрыИтого = Новый Структура;
	ПараметрыИтого.Вставить("БухКоличество",           0);
	ПараметрыИтого.Вставить("БухСумма",                0);
	ПараметрыИтого.Вставить("ФактКоличество",          0);
	ПараметрыИтого.Вставить("ФактСумма",               0);
	ПараметрыИтого.Вставить("РезультатИзлишекКолво",   0);
	ПараметрыИтого.Вставить("РезультатИзлишекСумма",   0);
	ПараметрыИтого.Вставить("РезультатНедостачаКолво", 0);
	ПараметрыИтого.Вставить("РезультатНедостачаСумма", 0);
	
	Возврат ПараметрыИтого;
	
КонецФункции

Функция ИнициализироватьНумерацию()
	
	Нумерация = Новый Структура;
	Нумерация.Вставить("НомерСтроки"  , 0);
	Нумерация.Вставить("НомерСтраницы", 1);
	Нумерация.Вставить("НомерСтрокиНаСтранице", 0);
	
	Возврат Нумерация;
	
КонецФункции

Функция СформироватьИтогиПрописью(ПараметрыИсточник, ВалютаПечати, НомерСтроки, ТекстИтого)
	
	КоличествоНаименованийПрописью          = ЧислоПрописью(НомерСтроки, , ",,,,,,,,0");
	ОбщееКоличествоЕдиницФактическиПрописью = ОбщегоНазначенияПоддержкаПроектов.КоличествоПрописью(ПараметрыИсточник.ФактКоличество);
	СуммаФактическиПрописью                 = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ПараметрыИсточник.ФактСумма, ВалютаПечати);
	
	ПараметрыИтогов = Новый Структура;
	ПараметрыИтогов.Вставить("ТекстИтого",                              ТекстИтого);
	ПараметрыИтогов.Вставить("КоличествоНаименованийПрописью",          КоличествоНаименованийПрописью);
	ПараметрыИтогов.Вставить("ОбщееКоличествоЕдиницФактическиПрописью", ОбщееКоличествоЕдиницФактическиПрописью);
	ПараметрыИтогов.Вставить("СуммаФактическиПрописью",                 СуммаФактическиПрописью);
	
	Возврат ПараметрыИтогов;
	
КонецФункции

Функция ПроверитьВыводСтроки(ТабличныйДокумент, Макет, МассивВыводимыхОбластей, ТекущаяОбласть, ЭтоПоследняяСтрока)
	
	МассивВыводимыхОбластей.Очистить();
	МассивВыводимыхОбластей.Добавить(ТекущаяОбласть);
	МассивВыводимыхОбластей.Добавить(Макет.ПолучитьОбласть("Итого"));
	МассивВыводимыхОбластей.Добавить(Макет.ПолучитьОбласть("ИтогоПрописью"));
	Если ЭтоПоследняяСтрока Тогда
		МассивВыводимыхОбластей.Добавить(Макет.ПолучитьОбласть("Итого"));
	КонецЕсли;
	
	Возврат Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, МассивВыводимыхОбластей);
	
КонецФункции

Функция МетаданныеМакета()
	
	Возврат Метаданные.Обработки.ПечатьИнвентаризационнаяОпись.Макеты.ПФ_MXL_ИнвентаризационнаяОписьНФА_0504087;
	
КонецФункции

Функция МетаданныеМакетаАктИнвентаризации()
	
	Возврат Метаданные.Обработки.ПечатьИнвентаризационнаяОпись.Макеты.ПФ_MXL_АктИнвентаризации;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
